backend/app/models/user.rb

INSERT INTO "users" ("email", "encrypted_password", "name", "is_guest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "[FILTERED]"], ["encrypted_password", "[FILTERED]"], ["name", nil], ["is_guest", true], ["created_at", "2025-08-09 05:52:27.634730"], ["updated_at", "2025-08-09 05:52:27.634730"]]
---
  def self.create_guest_user